{
  "format": "layers-model",
  "generatedBy": "TeachableMachine Image Project",
  "convertedBy": "TensorFlow.js Converter v1.7.4",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sampah-detektor",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "name": "input_1"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "name": "flatten_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "name": "dense_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 3,
            "activation": "softmax",
            "name": "output"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        { "name": "dense_1/kernel", "shape": [150528, 128], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [128], "dtype": "float32" },
        { "name": "output/kernel", "shape": [128, 3], "dtype": "float32" },
        { "name": "output/bias", "shape": [3], "dtype": "float32" }
      ]
    }
  ],
  "signature": null,
  "userDefinedMetadata": {},
  "modelInitializer": null
}
